In [1]:
import pandas as pd
import numpy as np

In [3]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [4]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [5]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [6]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [7]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [8]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [9]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [10]:
pop_df.unstack()

               total            under18
                2000      2010     2000     2010
California  33871648  37253956  9267089  9284094
New York    18976457  19378102  4687374  4318033
Texas       20851820  25145561  5906301  6879014

In [12]:
#most stright forward way yo construct a multiply indexed series
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.232195  0.373912
  2  0.162304  0.737319
b 1  0.675660  0.394966
  2  0.515201  0.316392

In [13]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [14]:
#Explicit MultiIndex constructors

In [15]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [16]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [17]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [18]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

c:\users\mercy mueni mwangi\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: the 'labels' keyword is deprecated, use 'codes' instead

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [20]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [1]:
import numpy as np
import pandas as pd

In [3]:
g=pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])
g

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [9]:
#multiIndex level names
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})

pop.index.names = ['state']
pop

state
(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

AttributeError: 'Index' object has no attribute 'remove_unused_levels'

In [12]:
#MultiIndex for columns

In [13]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      54.0  37.0  46.0  36.8  19.0  38.4
     2      30.0  38.1  60.0  38.7  18.0  37.6
2014 1      44.0  38.1  44.0  36.2  31.0  36.5
     2      25.0  37.3  38.0  36.0  39.0  36.8

In [23]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      46.0  36.8
     2      60.0  38.7
2014 1      44.0  36.2
     2      38.0  36.0

In [24]:
health_data['Sue']

type          HR  Temp
year visit
2013 1      19.0  38.4
     2      18.0  37.6
2014 1      31.0  36.5
     2      39.0  36.8

In [25]:
#Indexing and Slicing a MultiIndex

In [26]:
#Multiply indexed Series

In [27]:
pop

state
(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [30]:
pop['California', 2000]

33871648

In [32]:
#Multiply indexed DataFrames

In [33]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      54.0  37.0  46.0  36.8  19.0  38.4
     2      30.0  38.1  60.0  38.7  18.0  37.6
2014 1      44.0  38.1  44.0  36.2  31.0  36.5
     2      25.0  37.3  38.0  36.0  39.0  36.8

In [34]:
health_data['Guido', 'HR']

year  visit
2013  1        46.0
      2        60.0
2014  1        44.0
      2        38.0
Name: (Guido, HR), dtype: float64

In [35]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      54.0  37.0
     2      30.0  38.1

In [36]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        54.0
      2        30.0
2014  1        44.0
      2        25.0
Name: (Bob, HR), dtype: float64

In [37]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      54.0  37.0  46.0  36.8  19.0  38.4
     2      30.0  38.1  60.0  38.7  18.0  37.6
2014 1      44.0  38.1  44.0  36.2  31.0  36.5
     2      25.0  37.3  38.0  36.0  39.0  36.8

In [38]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      54.0  46.0  19.0
2014 1      44.0  44.0  31.0

In [1]:
import pandas as pd
import numpy as np

In [3]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  37.7  29.0  36.8  30.0  37.9
     2      39.0  38.0  43.0  37.0  45.0  38.1
2014 1      35.0  37.2  33.0  37.0  31.0  36.7
     2      34.0  36.4  20.0  37.5  36.0  37.1

In [5]:
data_mean= health_data.mean(level= 'year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     39.5  37.85  36.0  36.90  37.5  38.0
2014     34.5  36.80  26.5  37.25  33.5  36.9

In [11]:
data_mean1 = health_data.mean(axis=1,level='type')
data_mean1

type               HR       Temp
year visit
2013 1      33.000000  37.466667
     2      42.333333  37.700000
2014 1      33.000000  36.966667
     2      30.000000  37.000000

In [12]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  37.666667  37.583333
2014  31.500000  36.983333